Repository: acloudmovingby/Translation-Assistance-Tool
Catalog: Import Files/th_en_batch_1_fixed_chunk5.csv-650387.tmx
Source language: th_th
Languages: en_us

source: เคยไปปากน้ำรึเปล่าครับ?
en_us: Have you ever been to the estuary?

source: เทคโนโลยีนี้เป็นผลมาจากการปรับปรุงอัตรารีเฟรชหน้าจอ
en_us: This technology is a result of improvements in screen refresh rates.

source: เราอย่าไปใกล้มันนะครับ
en_us: We don't go near it.

source: เอาใจคนรักอาหารญี่ปุ่นไปกับ "ซูชิ" หลากหลายหน้าเช่น...
en_us: Pamper a lover of Japanese cuisine with different styles of "Sushi" such as...

source: แต่ถ้าเกิดว่าผมไปดูที่วิสต้า
en_us: but if I check on Vista

source: แต่ว่าอาหารเม็ดมันก็กินได้นะครับแต่ว่ากินได้สักแป๊บหนึ่ง
en_us: can eat pellet food though but only for a bit

source: แต่ว่าเราอย่าแอบดูมันนะครับ
en_us: But we kept ourselves from looking at it.

source: แบ่งตามประเภทการใช้จ่าย
en_us: Divided according to type of expense.

source: และถวายฐานันดรศักดิ์ เป็น กรมหลวง
en_us: and bestowed the noble title of Krom Luang.

source: และเทคโนโลยีแบ็คไลท์
en_us: and blacklight technology

source: แล้วก็คอมพิวเตอร์ที่เราเรียกกันว่าโน๊ตบุ๊ค
en_us: And the computer that we call a notebook

source: แล้วเราก็ไปจ่ายตังค์ได้นะครับ
en_us: and then we can pay.

source: โปรแกรมที่ใช้แฟรช
en_us: program using Flash

source: โอเรียนทอล สวีท
en_us: Oriental Suite

source: ใช้จ่ายเงินสกุลต่างประเทศ
en_us: spend foreign currency

source: ในขณะที่พิธีการต้องหยุดชะงักชั่วครู่
en_us: while the ritual had to stop abruptly for a moment

source: ในวันที่วันที่ 28 ตุลาคม พ.ศ. 2499 เสด็จฯ ไปทรงรับบิณฑบาต
en_us: On October 28, 2499, he received alms.

source: ให้ลองกดปิดเครื่อง1ครั้ง
en_us: Try and turn off the the machine 1 time.

source: กดไลค์+กดแชร์+กดติดตามเพจ+เห็นโพสก่อนด้วยนะ
en_us: Like + Share + Follow + See Post First

source: กางเกงชั้นใน / บิกินี่
en_us: Underwear / Bikinis

source: ก็จะมีสาวกไปรอต่อคิวซื้อจับจองมาเป็นเจ้าของคนแรกเสมอๆ
en_us: A follower will stake out a place in line as the first owner.

source: คนอื่นๆก็ไม่สามารถมาใช้เครื่องคุณได้ถ้าคุณไม่อนุญาต
en_us: Others cannot use your machine if you don't give permission.

source: ซื้อสินค้าครบทุก 500 บาทรับสิทธิ์จับรางวัลลุ้นฟรี!!
en_us: Buy 500 baht worth of goods and become eligible for free-to-enter sweepstakes!!

source: ตู้แช่ 2 ระบบความเย็น
en_us: freezer 2 cooling system

source: ทำให้เขาได้บังเอิญเจอกับ กุดั่น หญิงสาวเชยๆ ธรรมดา ไม่มีเสน่ห์ เมื่อกุดั่นเห็นภูวดลเธอตกหลุมรักเขาตั้งแต่แรกพบ
en_us: led him to accidentally meeting Kudan, a plain, ordinary, and uncharming woman. When Kudan saw Phuwadon, she fell in love at first sight.

source: นี้เป็นจริงฉบับแก้ไขที่ดีและก็ไม่ได้ชะลอตัวเครื่องคอมพิวเตอร์ของคุณ
en_us: NS

source: น่ารักทะลุโซเชียล
en_us: incredibly cute

source: ประเภทราชกิจจานุเบกษาที่ประกาศล่าสุด :
en_us: The type of government gazette last announced:

source: รวมพลผสานใจรักให้เต็มดวง!!
en_us: to come together as one!!

source: รับประกันสินค้า 15 วัน โดยผู้ขาย
en_us: Product guaranteed for 15 days by the seller.

source: รุ่นนี้มีคุณภาพที่ดีขึ้นในกราฟิกและในภาพ
en_us: This model has higher quality graphics and image.

source: ลิปสติกเนื้อแมทในโทนสีเด่นชัด
en_us: matte lipstick in a vivid tone

source: เครื่องซักผ้าพร้อมอบแห้ง
en_us: laundry machine with dryer

source: เครื่องหมายการค้าทั้งหมดเป็นทรัพย์สินของเจ้าของแต่ละรายในสหรัฐอเมริกาและประเทศอื่น
en_us: All trademarks are the property of their respective owners in the USA and other countries.

source: เอฟเค รอสตอฟ
en_us: FK Rostov

source: แผงบังแดดพร้อมกระจกแต่งหน้าแบบมีฝาปิด
en_us: sun shade and makeup mirror with a cover

source: และที่สำคัญราคาเพียงแค่ 5 พันกว่าบาทเท่านั้นเอง
en_us: and, importantly, the prices is only a bit over 5 thousand baht

source: และสามารถตกแต่งภาพก่อนที่จะอัพโหลดสู่สาธารณะได้อีกด้วย
en_us: and can edit the picture again before uploading to the public

source: โดยไม่ต้องเพิ่มอุปกรณ์ใดๆเข้ามาช่วย
en_us: without requiring additional equipment

source: - วิเคราะห์ภาวะเงินเฟ้อของไทย
en_us: - analyze inflation in Thailand

source: - สรุปและวิเคราะห์ข่าวเศรษฐกิจ
en_us: -summarize and analyze economic news

source: 10 ครีมบำรุงผิวตัวท็อป
en_us: 10 top skin care creams

source: กรุณากรอกรหัสผ่าน และ รหัสผ่านต้องไม่มีค่าว่าง ลืมรหัสผ่าน?
en_us: Please enter your password and your password can't be null. Forgotten your password?

source: กางเกงขาสั้นผ้ายืดแบบดราย
en_us: the Dry type of stretchy shorts

source: การปรับปรุงปีฐานและน้ำหนัก
en_us: base year and weight update

source: การให้บริการ การให้บริการ
en_us: Giving service. Giving service.

source: ขอแบบฟอร์มการชำระเงิน
en_us: request the payment form

source: ข้อมูลจากแหล่งข้อมูลของบุคคลภายนอก
en_us: data from external data sources

source: คู่แต่งงานที่หย่าร้างกัน
en_us: wedding couple who divorced

source: ซึ่งผู้ให้บริการนี้อาจได้รับและจัดเก็บการสั่งงานด้วยเสียง)
en_us: NS

source: ซึ่งออกแบบมาเพื่อให้ผู้บริโภคมีตัวเลือกว่าจะรับโฆษณาที่มุ่งเน้นกลุ่มเป้าหมายหรือไม่
en_us: which was designed so that consumers have a choice whether to receive advertisements which focus on target group or not.

source: ด้วยหลากหลายสินค้าให้คุณได้บอกเล่าเรื่องราวกิจกรรมที่เคยทำหรือสถานที่ต่างๆ
en_us: with a plethora of products so you can tell stories about activities you've done or places

source: ต้องแสดงคูปองก่อนเข้ารับบริการ
en_us: must show coupon before receiving service

source: ทรูสโตร์ วีเลิฟช้อปปิ้ง ไอทรูมาร์ท
en_us: True Store We Love Shopping iTruemart

source: ทรูไลฟ์ ทรูมิวสิค ทรูมูฟวี่ ทรูสปอร์ต ทรูเอเอฟ ทรูนิวส์ ทรูเทคทอล์ก
en_us: True Life True Music True Movie True Sport True AF True News True Techtalk

source: ที่สะท้อนความเป็นคุณทุกเส้นสาย
en_us: every line of which reflects you

source: นอกเหนือจากข้อมูลที่คุณให้ไว้
en_us: other than the information you provided

source: บริการบางอย่างจะทำให้คุณสามารถให้ข้อมูลกับเราได้โดยตรง ตัวอย่างเช่น
en_us: Some services allow you to provide us with information directly such as

source: บัตรเครดิตร่วมคิง เพาเวอร์ - กสิกรไทย
en_us: King Power - Kasikornthai Bank joint credit card

source: บุฟเฟ่ต์อาหารนานาชาติมื้อกลางวัน ให้คุณ อิ่มไม่อั้น กินแบบไม่ต้องเบรก
en_us: international lunch buffet will leave you feeling stuffed with continuous eating

source: ผู้ใช้ดูโฆษณาเหล่านั้นบ่อยเพียงใด
en_us: how often did users see those advertisements

source: พระชัยวัฒน์สี่มุมเมือง 3 โค๊ต สภาพสวยแชมป์
en_us: The Phrachai Wat Si Mum Mueang 3 Khod is beautiful enough to win a prize.

source: พระอาจารย์นำ แก้วจันทร์ วัดดอนศาลา พัทลุง กับพ่อท่านคลิ้ง วัดถลุงทอง นครศรีธรรมราช
en_us: Phra Ajahn Nam Kaewchan of Don Sala Temple in Phatlung with Phor Than Khling of Thalung Thong Temple in Nakhon Si Thammarat

source: พร้อมจิบเครื่องดื่มม็อกเทล รสชาติดี ท่ามกลางบรรยากาศสุดชิลล์!!
en_us: while sipping a tasty cocktail with chill ambience

source: ภายใต้ขอบเขตอำนาจของกฎหมายบางแห่ง
en_us: within the scope of the law in some places

source: มีหูจับด้านบน และ ด้านข้าง
en_us: has handles on top and on the sides

source: ยามาฮ่า พร้อมร่วมงาน "แบงค์ค็อก มอเตอร์ไบค์ เฟสติวัล 2015"
en_us: Yamaha is is a collaborator for the "Bangkok Motorbike Festival 2015"

source: รวมถึงผ่านทางการใช้ คุกกี้ บีคอน และเทคโนโลยีประเภทเดียวกัน
en_us: including use of cookies, beacons, and other similar technologies.

source: รวมทั้งเว็บไซต์และโปรแกรมอื่นๆ
en_us: including websites and other programs

source: รายชื่อเอกสาร/รายงานสำหรับแจก
en_us: list of document names / report for distribution

source: ลิงก์และผลิตภัณฑ์ของบุคคลภายนอกบนบริการของเรา
en_us: Links and products from third parties represented on our service

source: ล้อแม็กขนาด 17 นิ้ว
en_us: 17 inch rims

source: สถาบันกรมพระจันทบุรีนฤนาถ
en_us: Institution of Krom Phra Chunthaburi Naruenat

source: สมาชิกรับบริการและตอบแบบสอบถามข้อมูล
en_us: Members receive service and answer informational questionnaires

source: สวิตช์ควบคุมโหมดการขับขี่ด้วยมอเตอร์ไฟฟ้า
en_us: the switch controls the driving mode with an electric motor

source: สำนักงานปลัดกระทรวงพาณิชย์ เวลา เวลา 10.30 น.
en_us: Office of the Permanent Secretary Ministry of Commerce time time 10:30 am

source: สำหรับผู้ชายวัย 30 ขึ้นไป
en_us: for men ages 30 and older

source: ส่งไฟล์ข้อมูลให้ส่วนกลาง . แบบสำรวจช่องทางการให้บริการ
en_us: send the file to central . survey for many types of service

source: หรือตามที่จำเป็นเพื่อคุ้มครองบริการของเรา
en_us: or as needed in order to protect our service

source: หรือตามที่สัญญาใดๆ
en_us: or as per some contract

source: หรือติดตามว่าโฆษณาใดบ้างที่ผู้ใช้ได้ดู
en_us: or to see what advertisements users had seen

source: หรือเข้าจากรายการร้านค้าโปรดของฉัน
en_us: NS

source: หรือเป็นคำขอซึ่งกฎหมายท้องถิ่นนั้นไม่ได้กำหนดให้มีการเข้าถึงข้อมูล
en_us: or is a request for information which such local laws haven't allowed access to

source: หากคุณต้องการร้องขอที่จะเข้าถึงข้อมูลของคุณ
en_us: if you need to request access to your information

source: อาจใช้ในเทคโนโลยีลักษณะอื่นๆ
en_us: may be used with other kinds of technology

source: อาหารแซ่บ แม่ค้าสวย 6 ร้านที่หนุ่มๆ ต้องไปลองชิม
en_us: the food is tasty. There are beautiful shopkeepers at the 6 shops that the young men have to try

source: เทคโนโลยีเกี่ยวกับพื้นที่เก็บข้อมูลในเครื่อง บีคอน และข้อมูลดังกล่าว
en_us: technology concerning storage space on the device, beacons, and said data

source: เผยแพร่ วันที่ 26 ต.ค.59
en_us: broadcast on 26 Oct., '16

source: เพราะการได้แบ่งปันเรื่องนี้กับคนที่รักนั้นเป็นเรื่องที่ดีที่สุดแล้ว
en_us: because to share this with that lover was the best thing to do

source: เรายังอาจเก็บรวบรวมข้อมูลอื่นๆ
en_us: We may still collect other data.

source: เราอาจขอทราบชื่อของคุณ ข้อมูลติดต่อ ที่อยู่สำหรับจัดส่งและเรียกเก็บเงิน
en_us: We may ask for your name, contact information, and delivery address, and may request payment.

source: เอสพละนาดรัชดา
en_us: The Esplanade at Ratchada

source: แบบรูปรายการและรายการประกอบแบบก่อสร้าง ปีงบประมาณ พ.ศ.2559 (งบประมาณกระตุ้นเศรษฐกิจ)
en_us: List of pictures and accompanying list of construction drawings for the budget year 2016 (economic stimulus budget)

source: และ/หรือการที่คุณให้ข้อมูลของคุณกับเรา
en_us: and/or giving us your personal information

source: และผู้ใช้ตอบสนองอย่างไรต่อโฆษณาเหล่านั้น และ
en_us: and how users respond to those advertisements and

source: และร่วมติดตามตรวจสอบการปฏิบัติราชการ
en_us: and follow up with examining government actions

source: และวิธีที่คุณโต้ตอบกับเนื้อหาที่เสนอให้ผ่านทางบริการของเรา
en_us: and the method of your response to the content of our service

source: และอาจให้สื่อส่งเสริมการขาย โฆษณา และสื่ออื่นๆ กับคุณ
en_us: and may give sales promotional material, advertisements, and other media to you.

source: โดยการใช้หรือเข้าร่วมบริการใดๆ
en_us: through use or participation in some service

source: โปรดติดต่อฝ่ายลูกค้าสัมพันธ์ของเราที่
en_us: please contact our customer relations at

source: ในการเข้าถึงบริการของเรา
en_us: when using our service

source: ให้คุณได้อิ่มในแบ...
en_us: make you full of...

source: ให้ชีวิตคุณไม่เหมือนเดิมอีกต่อไป
en_us: changing your life forever

source: “ข้าวเหนียวขนุน” อร่อยแบบไทย เฉพาะเดือนกันยา...
en_us: "Sticky Rice with Jackfruit" deliciously Thai-style, only during September...

source: “พิซซ่าแซลมอนรมควัน” ความอร่อยแบบพีคๆ ที่โรง...
en_us: the supremely delicious "Smoked Salmon Pizza" at...

source: • คุกกี้จะช่วยให้เราและบุคคลภายนอกเข้าใจได้ว่าโฆษณาใดที่คุณได้ดูแล้ว
en_us: • Cookies will help us and third parties know what advertisements you have already seen

source: • ผู้ให้บริการ เรายังอาจเปิดเผยข้อมูลของคุณต่อบริษัทที่ให้บริการกับเราหรือในนามของเรา เช่น บริษัทที่ช่วยเราเรียกเก็บเงิน
en_us: • Service Providers: we may disclose your information with companies that provide service in our name such as companies that help us collect payment.

source: • หากคุณสั่งซื้อผลิตภัณฑ์หรือบริการที่ต้องชำระเงินจากเรา
en_us: • If you order products or service from us that require payment

source: • เพื่อลงทะเบียนตัวคุณหรืออุปกรณ์ของคุณสำหรับบริการ
en_us: • To register your or your device for service

source: 13. พฤติกรรมการเดิมพันที่ฉ้อฉล
en_us: 13. Fraudulent betting behavior

source: การวางเดิมพันที่ค่าน้ำแบบเดซิมอลที่น้อยกว่า 1.50 หรือเทียบเท่าในค่าน้ำแบบอื่น
en_us: betting using decimal odds of less than 1.50 or the equivalent using some other form of odds

source: กุญแจรีโมทพร้อมสวิตช์เปิดฝากระโปรงท้าย
en_us: remote key with switch to open the trunk

source: ครัวคริตจานด่วน (135)
en_us: Khrit's Fast Food Kitchen (135)

source: คุณจึงสามารถเพลิดเพลินกับภาพยนตร์แอ็คชัน กีฬา และความบันเทิงอื่นๆ
en_us: You can enjoy action movies, sports, and other forms of entertainment.

source: จะลุคไหนก็ปัง!
en_us: every style looks cool!

source: จึงพิจารณาในขั้นต่อๆไป
en_us: for further consideration at a later stage

source: ซึ่งเขาหวังจะแต่งงานด้วยในอนาคต
en_us: he wishes to marry as well in the future

source: ดูโดเรมอนรวมทุกตอนได้ที่
en_us: watch all Doraemon episodes at

source: ตบเข่าด้วยความฟิน!
en_us: knee-slappingly awesome!

source: ถือว่าผู้เล่นได้มอบลิขสิทธิ์อันเป็นทรัพย์สินทางปัญญา
en_us: the players are considered to have granted the intellectual property rights

source: ทำให้นึกต่อไปถึงตุ๊กตา แมว ล้มลุก และกลายเป็นโดเรมอนในที่สุด
en_us: makes you think of a roly-poly cat doll and in the end becomes Doraemon

source: ทำให้โนบิตะต้องอิจฉา
en_us: must make Nobita jealous

source: ทำไมต้องเลือกมิชลิน
en_us: Why should he choose Michelin?

source: ที่ส่วนใหญ่ไม่เคยดู
en_us: most of which have never been seen

source: ที่โดเรม่อนไม่สามารถแก้ไขได้
en_us: which Doraemon can't solve

source: นวัตกรรมใหม่ วิธีการสร้างอุโมงค์ต่างประเทศ
en_us: a new innovative technique for constructing tunnels abroad

source: บริษัทตัวแทนพร้อมเจ้าหน้าที่ที่เกี่ยวข้อง
en_us: agency together with relevant personnel

source: ปรับหน้าให้เรียวเล็กแบบฉับพลันใน 1 นาที ด้วยดูโอสติ๊กขั้นเทพ ช่วยให้สาวๆ ดูหน้าเล็กลงอย่างรวดเร็ว
en_us: make the face more slender instantly in 1 second with the advanced DuoStick. It helps young ladies quickly slim down their face

source: ผลหวยย้อนหลัง 10 งวดล่าสุด ดูทั้งหมด
en_us: See all of the last 10 lottery results.

source: ผู้เล่นต้องยินยอมว่าจะทำการใดๆและ/หรือจัดการเอกสารทางกฎหมายจนเป็นที่น่าพึงพอใจ
en_us: Players must agree to take any actions and/or prepare legal documentation until satisfied.

source: ผู้เล่นที่ใช้หลายบัญชีจะถูกลงโทษตามกฎกติกาโดยไม่มีการผ่อนผัน
en_us: Players using multiple accounts will be penalized in strict accordance with the rules.

source: พระองค์ทรงมีพระราชานุญาตในวันพระราชสมภพปี 2559 12 พ.ย. 2559
en_us: He gave permission on the birthday, 2016, 12 Nov 2016.

source: พร้อมเชพใบหน้าให้ดูพุ่ง
en_us: with a well-contoured face

source: มีหลากสีตั้งแต่ดำสโมคกี้
en_us: there are many colors starting with Smoky Black

source: มุมมองใหม่แห่งความบันเทิง
en_us: new perspective in entertainment

source: รวมถึงข้อกำหนดและเงื่อนไขโดยทั่วไปในเว็บไซต์นี้ด้วย
en_us: including as well the general terms and conditions of this website

source: รวมทั้งการเดิมพันทั้ง 2 ฝั่ง ที่รายการและรูปแบบการเดิมพันเดียวกัน
en_us: including betting on both sides of the program and other equivalent betting forms.

source: รวมทั้งโนบิตะด้วย
en_us: including Nobita as well

source: ระบบปัดน้ำฝนแบบหน่วงเวลา
en_us: time delay wiper system

source: รับเทิร์นรถเก่าให้ราคาสูง
en_us: taking old car trade-ins for a high price

source: วันเดียวเพจวิว 5 ล้าน
en_us: 5 million pageviews in one day

source: สวยสายซอฟต์แบบไม่เฟค
en_us: non-fake, beautiful soft variety

source: สาวแฟชั่นนิสต้าทั้งหลายถ้ากลัวเอาท์ ต้องดู!
en_us: all fashionista ladies afraid of out must watch

source: หากไม่สามารถแสดงหลักฐานดังกล่าวได้
en_us: if unable to provide said evidence

source: หาข้อมูลการติดต่อเพิ่มเติมได้ที่นี่
en_us: find further contact information here

source: ห้องพักขนาดใหญ่กว่า 28 ตรม. มีห้องน้ำในตัว
en_us: rooms over 28 sqm. with attached bathroom

source: อวสานเล็บขบ | อาการเป็นยังไงบอกหมอสิ!
en_us: No more in-grow nails | Whatever the symptoms, tell the doctor!

source: เค้าทำกันแบบนี้เอง
en_us: They did like this

source: เทียบเท่ากับการใช้บีบีทั่วไป
en_us: equivalent to general BB use

source: เปลี่ยนจนต้องบอกว่า เหลือเชื่อ
en_us: changed to the point of disbelief

source: เป็นคนไม่เอาถ่าน อ่อนแอ ไม่เคยพึ่งพาตนเอง
en_us: is good-for-nothing, weak, and never self-reliant.

source: เฟรนช์ ดอร์
en_us: French Door

source: เมย์เบลลีน นิวยอร์ก
en_us: Maybelline New York

source: เรามาลองเช็คกันดีกว่าว่าเรามี
en_us: It's better for us to check and see whether we have or not.

source: เรียนหนังสือไม่เก่ง สอบได้ 0 บ่อยๆ มาโรงเรียนสายประจำ
en_us: is not a good student, gets 0's often, regularly comes late to school

source: แต่ก็มักจะมีอุปสรรค
en_us: but often there are obstacles

source: แต่โนบิตะในอนาคต
en_us: but Nobita in the future

source: แมทได้หน้าไม่มัน
en_us: matte, makes the face not oily

source: แม่บ้านรักการปรับปรุงต่อเติม
en_us: the housekeeper loves renovations

source: และในการประชาสัมพันธ์ทางการตลาด
en_us: and through PR marketing

source: โดดเด่นกว่าใครในนิวยอร์ก
en_us: more remarkable than anyone in New York

source: โดยที่อาจไม่เคยมีประวัติการเดิมพันหรือความต้องการวางเดิมพัน
en_us: without ever having a history of betting or a desire to place bets

source: โดยบังเอิญหรือเป็นผลสืบเนื่อง
en_us: by accident or was a consequence

source: โดเรมีก็จะมาคอยช่วยเหลือเสมอๆ
en_us: Doremi always comes to help

source: โดเรมีจะอยู่ในโลกอนาคตมากกว่า
en_us: Doremi is more in the future

source: ให้ความช่วยเหลือ และ การแก้ไขปัญหา
en_us: to help or problem resolution

source: ได้แต่งงานกับโนบิตะจริงๆ
en_us: really did marry Nobita

source: ไล่ฝ้ากระจกหน้า-หลัง
en_us: front-rear defroster

source: &apos;บิ๊กหนุ่ย&apos;ขอบคุณ&apos;ผู้ปกครอง-ท้องถิ่น&apos;ไม่ค้านควบร.ร.เล็ก
en_us: 'Big Nui' thanks the 'local officials' for not opposing the merger of small schools.

source: การครอบคลุมการมองเห็นภาพ
en_us: vision coverage

source: การเขียนโค้ดช่วยปลดปล่อยพลังสร้างสรรค์
en_us: writing code helps release creative energy

source: กำหนดเวลาที่ใช้ดำเนินการสำหรับบริการทางการเงินต่างๆ
en_us: determine time used for carrying out tasks for financial services

source: ของทุกคำที่ปรากฏ บนหนังสือ เบราเซอร์ หรือแอพได้
en_us: of every word which appears in a book, browser, or app.

source: ข้าพเจ้าสมัครสมาชิกก่อนหน้าเดือนกันยายน 2559
en_us: I applied to be a member before September 2016.

source: ครึ่งกิโลกรัม จึงเบาพอ ที่นักเรียนจะพกติดตัวไป
en_us: Half a kilogram is light enough for students to carry on their person.

source: คุณเองเพื่อการเรียนรู้ที่น่าจดจำยิ่งขึ้น
en_us: you yourself for the sake of even more memorable learning.

source: จัดสรรความต้องการและความเสี่ยง
en_us: balancing needs and risks

source: จากส่วนไหนของห้องเรียนก็ได้
en_us: from any part of the room

source: ซึ่งจะช่วยเปิดหนทาง ใหม่ๆ ให้ครูและนักเรียน
en_us: which will help open a new path for teachers and students.

source: ตำแหน่งสูงสุดของข้าพเจ้าในช่วงเดือนพฤษภาคม ถึง สิงหาคม 2559
en_us: my highest position from May until August 2016

source: ถัดไป การซื้อและบริการช่วยเหลือ
en_us: next purchasing and assistance

source: ที่คุณโยนใส่ในกระเป๋าเป้ได้
en_us: which you can put in a backpack

source: ที่ยกทะเลมาเสริ์ฟ
en_us: which brings the sea to be served

source: ที่ใช้ระบบปฏิบัติการอื่นอยู่ล่ะก็
en_us: who uses another operating system and

source: ทุกการคลิกคือวิธีการสอนที่มากขึ้น
en_us: every click leads to new learning

source: ท่านกำลังออกจากเว็บไซต์ของธนาคาร
en_us: You are exiting the bank's website.

source: ท่าอากาศยานนานาชาติอู่ตะเภา-ระยอง พัทยา ตั้งอยู่ที่รอยต่อระหว่างจังหวัดชลบุรีและจังหวัดระยอง
en_us: The Utapao International Airport-Rayong Pattaya is at the border between Chonburi Province and Rayong Province.

source: บริการออนไลน์แบงกิ้ง
en_us: online banking service

source: บริษัทที่เติบโตเร็วที่สุดแห่งทศวรรษ
en_us: the fastest growing company of the decade

source: บัญชีเงินฝากประจำเงินตราต่างประเทศ
en_us: foreign currency deposit account

source: บัญชีเงินฝากออมทรัพย์เงินตราต่างประเทศ
en_us: foreign currency savings account

source: บัตรมาสเตอร์คาร์ด ไทเทเนียม
en_us: Titanium Mastercard

source: บัตรหอการค้าไทยและสภาหอการค้าแห่งประเทศไทย
en_us: Card for the Thai Chamber of Commerce and the Board of Trade of Thailand

source: ประสบการณ์ที่ดีกว่าในทุกสัมผัส
en_us: A better experience with every touch.

source: ผนวกกับแผนการเรียน การสอน ได้ไม่จบไม่สิ้น
en_us: , combined with the education program, was endless.

source: ผลิตภัณฑ์ของเรา ถูกออกแบบมา เพื่อ นักเรียนทุกคน
en_us: Our products are designed for all students.

source: พกพาไปรอบสถานศึกษา
en_us: to be carried on person around school.

source: พบกับสื่อการเรียนรู้
en_us: encounter learning media

source: ฟุตบอล เดเอฟเบ โพคาล รอบ 2
en_us: round 2 of DFB-Pokal soccer

source: ยิ่งขึ้นด้วยภาพประกอบที่สวยงามและเลย์เอาท์
en_us: even greater with beautiful illustrations and layout

source: รวมถึงมิได้ยอมรับ แนะนำ หรือให้ความเห็นชอบเกี่ยวกับเนื้อหาสาระบนเว็บไซต์ภายนอกแต่ประการใด
en_us: including not acknowledging, recommending, or approving of the content on third party websites in any way.

source: วิเคราะห์เป้าหมายและความต้องการในการลงทุน
en_us: analyze goals and need for investment

source: สำหรับครูอาจารย์ โดยเฉพาะ เพื่อให้ง่ายต่อการ
en_us: for teachers especially to make it easier for

source: สิทธิ์ในการแลกซื้อและรับส่วนลดค่าเครื่องถือเป็นอันสิ้นสุดลง
en_us: The right to purchase and receive discounts on a device is terminated.

source: หาวิธีทำงานร่วมกับเพื่อนๆ
en_us: find a way to work with friends

source: อิลลูชั่น พลัส
en_us: Illusion Plus

source: ฮาร์ดแวร์ที่ออกแบบมา เพื่อ พาการเรียนรู้ ไปให้ไกลขึ้น
en_us: hardware designed to take learning to greater heights

source: เกมผีบ้านเกิดมันน่ากลัว
en_us: the household ghost game is scary

source: เตรียมมุ่งสู่การรับรองมาตราฐาน
en_us: prepare to adopt certification standards

source: เพราะเขารู้ตัวว่าคนไทยกลัวอะไร
en_us: because he's aware of what Thai people fear

source: เลอ ชาโต แมนชั่น เลอ ชาโต แมนชั่น 50,000 - 150,000 บาท/เดือน
en_us: Le Chateau Mansion Le Chateau Mansion 50,000 - 150,000 baht/month

source: แนะนำสินค้า - เทคโนโลยีเครื่องซักผ้าแบบใหม่
en_us: recommend products - new washing machine technologies

source: แผนประกันชีวิตเพื่อสนับสนุนการลงทุน
en_us: life insurance plan in order to support investment

source: แผ่นพับสถาบันคุ้มครองเงินฝาก ปี 2016
en_us: brochure for the Deposit Protection Agency for 2016

source: แรงบันดาลใจซึ่งคุณสามารถนำไป
en_us: inspiration which you can apply

source: และการดูแลสุขภาพในระดับชาติ
en_us: and healthcare at the national level

source: และซูมขยายได้ นอกจากนี้ยัง ลากและวางวิดีโอ
en_us: and can zoom in. Besides this, drag and drop video

source: และพร้อสอัฟเดด
en_us: and with an update

source: และลงทะเบียนสมัครที่เวปไซต์นี้เท่านั้น )
en_us: and register at this website only)

source: และอยู่ในอันดับที่ 87 ของผู้นำในด้านการผลิตผลิตภัณฑ์เสริมอาหาร
en_us: and is ranked 87th among leaders in food supplement products.

source: และอาจารย์สามารถค้นคว้าหาความรู้ได้แทบทุกเรื่อง
en_us: and the professor can search for almost any kind of information

source: และเพิ่มทักษะใน ด้านการอ่าน และคณิตศาสตร์ ของพวกเขา
en_us: and improves their reading and math abilities.

source: แล้วถ้าหากคุณกำลังมอง
en_us: and if you're looking

source: แล้วเปิดแอพตัวที่สอง
en_us: and then open the second app.

source: แอพสำหรับการศึกษามากกว่า 170,000 แอพ
en_us: more than 170,000 apps for studying

source: ใช้เป็นแผ่นคำศัพท์หรือรูปภาพในแบบของ
en_us: use as a vocabulary sheet or a picture like

source: ในการสอนและการเรียน
en_us: in teaching and learning

source: ในขณะที่เดินไปรอบๆ โต๊ะเรียน แล้วให้ความช่วยเหลือนักเรียน
en_us: while walking around the school desk and provides assistance to students

source: กิจกรรมรับอรุณแห่งความสุข
en_us: activity to receive the dawn of happiness

source: ขวนแห่กระทงและนางนพมาศและกรประกวดขบวนแห่กระทงใหญ่...
en_us: parade of krathong and Noppamas, and a contest for the large krathong parade

source: คนสู้โรค (198)
en_us: people battling illness (198)

source: คลิก "เพิ่มเติม" เพิ่มเติม ที่ด้านบนขวา
en_us: click "more" more at the upper right
